# Unlocking the Future: Predicting Real Estate Market Trends with Time Series Analysis

# INTRODUTION

## 1.1 Business Understanding

## 1.2 Problem Statement

## 1.3 Objectives

### 1.3.1 Main Objective

### 1.3.2 Specific Objectives

## 1.4 Data Understanding

# 2. LOADING LIBRARIES

In [20]:
#Importing the necessary libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns

## 3.DATA COLLECTION

In [21]:
#Loading the zillow dataset
data = pd.read_csv('zillow_data.csv')
data.head()

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,1996-04,1996-05,1996-06,...,2017-07,2017-08,2017-09,2017-10,2017-11,2017-12,2018-01,2018-02,2018-03,2018-04
0,84654,60657,Chicago,IL,Chicago,Cook,1,334200.0,335400.0,336500.0,...,1005500,1007500,1007800,1009600,1013300,1018700,1024400,1030700,1033800,1030600
1,90668,75070,McKinney,TX,Dallas-Fort Worth,Collin,2,235700.0,236900.0,236700.0,...,308000,310000,312500,314100,315000,316600,318100,319600,321100,321800
2,91982,77494,Katy,TX,Houston,Harris,3,210400.0,212200.0,212200.0,...,321000,320600,320200,320400,320800,321200,321200,323000,326900,329900
3,84616,60614,Chicago,IL,Chicago,Cook,4,498100.0,500900.0,503100.0,...,1289800,1287700,1287400,1291500,1296600,1299000,1302700,1306400,1308500,1307000
4,93144,79936,El Paso,TX,El Paso,El Paso,5,77300.0,77300.0,77300.0,...,119100,119400,120000,120300,120300,120300,120300,120500,121000,121500

In [22]:
#Converting the dataset from a wide format to a long format
df = pd.melt(data.copy(), id_vars = ['RegionID', 'RegionName', 'City', 'State', 'Metro', 'CountyName', 'SizeRank'], var_name = 'Time', value_name= 'Value')

In [23]:
#Displaying the first 5 rows
df.head()

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,Time,Value
0,84654,60657,Chicago,IL,Chicago,Cook,1,1996-04,334200.0
1,90668,75070,McKinney,TX,Dallas-Fort Worth,Collin,2,1996-04,235700.0
2,91982,77494,Katy,TX,Houston,Harris,3,1996-04,210400.0
3,84616,60614,Chicago,IL,Chicago,Cook,4,1996-04,498100.0
4,93144,79936,El Paso,TX,El Paso,El Paso,5,1996-04,77300.0

In [24]:
#Displaying the last 5 rows
df.tail()

,RegionID,RegionName,City,State,Metro,CountyName,SizeRank,Time,Value
3901590,58333,1338,Ashfield,MA,Greenfield Town,Franklin,14719,2018-04,209300.0
3901591,59107,3293,Woodstock,NH,Claremont,Grafton,14720,2018-04,225800.0
3901592,75672,40404,Berea,KY,Richmond,Madison,14721,2018-04,133400.0
3901593,93733,81225,Mount Crested Butte,CO,NaN,Gunnison,14722,2018-04,664400.0
3901594,95851,89155,Mesquite,NV,Las Vegas,Clark,14723,2018-04,357200.0

In [25]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3901595 entries, 0 to 3901594
Data columns (total 9 columns):
 #   Column      Dtype
---  ------      -----
 0   RegionID    int64
 1   RegionName  int64
 2   City        object
 3   State       object
 4   Metro       object
 5   CountyName  object
 6   SizeRank    int64
 7   Time        object
 8   Value       float64
dtypes: float64(1), int64(3), object(5)
memory usage: 267.9+ MB

In [26]:
df.describe()

           RegionID    RegionName      SizeRank         Value
count  3.901595e+06  3.901595e+06  3.901595e+06  3.744704e+06
mean   8.107501e+04  4.822235e+04  7.362000e+03  2.076064e+05
std    3.193304e+04  2.935833e+04  4.250165e+03  2.400207e+05
min    5.819600e+04  1.001000e+03  1.000000e+00  1.130000e+04
25%    6.717400e+04  2.210100e+04  3.681000e+03  9.790000e+04
50%    7.800700e+04  4.610600e+04  7.362000e+03  1.476000e+05
75%    9.092100e+04  7.520600e+04  1.104300e+04  2.372000e+05
max    7.538440e+05  9.990100e+04  1.472300e+04  1.931490e+07

In [30]:
df.shape

(3901595, 9)

The dataset above has both numerical and categorical variables. It has 3,901595 rows and 9 columns.

## 4. DATA PREPROCESSING

This process involves:
1. Handling missing values
2. outliers
3. data transformations

### 4.1 Detecting and handling missing values

In [28]:
#Checking for missing values in the dataset
df.isnull().sum()

RegionID           0
RegionName         0
City               0
State              0
Metro         276395
CountyName         0
SizeRank           0
Time               0
Value         156891
dtype: int64

The Metro and Value columns contain some missing data points.